backend/tests/load/scenarios/auth-load.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up - 10 req/sec"
    - duration: 180
      arrivalRate: 50
      name: "Moderate load - 50 req/sec"
    - duration: 180
      arrivalRate: 100
      name: "High load - 100 req/sec"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  processor: "../processor.js"
  variables:
    authToken: ""

scenarios:
  - name: "Health Check"
    weight: 50
    flow:
      # Health check
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  - name: "Profile Check"
    weight: 30
    flow:
      # Get profile
      - get:
          url: "/api/profile/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode:
                - 200
                - 401

  - name: "Alumni Status"
    weight: 20
    flow:
      # Get alumni status
      - get:
          url: "/api/alumni/status"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode:
                - 200
                - 401