backend/tests/load/scenarios/full-load.yml
config:
  target: "http://localhost:5000"
  processor: "../processor.js"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up to moderate"
    - duration: 180
      arrivalRate: 100
      name: "Sustained high load"
    - duration: 120
      arrivalRate: 200
      name: "Peak load"
    - duration: 60
      arrivalRate: 50
      name: "Ramp down"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  variables:
    authToken: ""

scenarios:
  # Health check - No auth needed (40%)
  - name: "Health Check"
    weight: 40
    flow:
      - get:
          url: "/api/health"

  # Posts read operations - Requires auth (30%)
  - name: "Read Posts"
    weight: 30
    flow:
      - get:
          url: "/api/posts"
          headers:
            Authorization: "Bearer {{ authToken }}"
      
      - get:
          url: "/api/posts/search"
          headers:
            Authorization: "Bearer {{ authToken }}"

  # Profile operations - Requires auth (15%)
  - name: "Profile Management"
    weight: 15
    flow:
      - get:
          url: "/api/profile/me"
          headers:
            Authorization: "Bearer {{ authToken }}"

  # Alumni status - Requires auth (10%)
  - name: "Alumni Status"
    weight: 10
    flow:
      - get:
          url: "/api/alumni/status"
          headers:
            Authorization: "Bearer {{ authToken }}"

  # Queries read - Requires auth (5%)
  - name: "My Queries"
    weight: 5
    flow:
      - get:
          url: "/api/queries/my"
          headers:
            Authorization: "Bearer {{ authToken }}"