backend/tests/load/scenarios/posts-load.yml
config:
  target: "http://localhost:5000"
  processor: "../processor.js"
  phases:
    - duration: 60
      arrivalRate: 20
      name: "Warm up"
    - duration: 180
      arrivalRate: 100
      name: "High load - 100 req/sec"
    - duration: 120
      arrivalRate: 200
      name: "Very high load - 200 req/sec"
    - duration: 60
      arrivalRate: 20
      name: "Cool down"
  variables:
    authToken: ""

scenarios:
  - name: "Posts Read Operations"
    weight: 50
    flow:
      # Get all posts
      - get:
          url: "/api/posts"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode:
                - 200
                - 401

      # Search posts
      - get:
          url: "/api/posts/search"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode:
                - 200
                - 401

  - name: "My Posts"
    weight: 30
    flow:
      # Get my posts
      - get:
          url: "/api/posts/my/all"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode:
                - 200
                - 401

  - name: "Health Check"
    weight: 20
    flow:
      # Health check
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
                - 200
                - 401
                - 404

      # Comment on post
      - post:
          url: "/api/posts/{{ $randomNumber(1, 100) }}/comment"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            content: "Great post! {{ $randomString() }}"
          expect:
            - statusCode:
                - 201
                - 401
                - 404