backend/tests/load/scenarios/quick-test.yml
config:
  target: "http://localhost:2478"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Quick test"
  processor: "../processor.js"
  variables:
    authToken: ""

scenarios:
  - name: "Quick Health and Profile Check"
    weight: 100
    flow:
      # Health check
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

      # Get profile (with auth)
      - get:
          url: "/api/profile/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200